background/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            false;
addLayers       false;

geometry
{   
    box         
    {
        type    searchableBox;    
        min     (-0.625 -0.8125 -0.4375);
        max     (6.625 0.8125 1.0625);
    }

    KwRefinement1.stl        
    {
        type    triSurfaceMesh;    
        name    kw1;
    }

    KwRefinement2.stl        
    {
        type    triSurfaceMesh;    
        name    kw2;
    }

    KwRefinement3.stl        
    {
        type    triSurfaceMesh;    
        name    kw3;
    }
};


castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 10000000;
    minRefinementCells 0;
    nCellsBetweenLevels 3;	
    insidePoint (-9.23149e-05 -0.0025 -0.0025); // Inside point
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 30;
    features
    (
    );

    refinementSurfaces
    {
    }
   

    refinementRegions
    {
        kw1
        {
        	mode  inside;
        	levels  ((1 1));                  // refinement level 4
        }
        kw2
        {
        	mode  inside;
        	levels  ((2 2));                  // refinement level 2
        }
        kw3
        {
        	mode  inside;
        	levels  ((3 3));                 // refinement level 2
        }
        box
        {
        	mode  inside;
        	levels  ((4 4));                  // refinement level 1
        }
    }
    locationInMesh ( 0 0 0 ) ;
}


snapControls
{
    nSmoothPatch 3;
    tolerance 1.0;
    nSolveIter 100;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}


addLayersControls
{
}


meshQualityControls
{
    minVol          1e-13;
    minTetQuality   1e-16;
    minArea         1e-13;
    minTwist        0.05;
    minDeterminant  1e-06;
    minFaceWeight   0.02;
    minVolRatio     0.01;
    minTriangleTwist -1;
    minFlatness     0.5;
    maxNonOrtho     70;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    nSmoothScale    4;
    errorReduction  0.75;

    relaxed
    {
        minVol          1e-30;
        minTetQuality   1e-30;
        minArea         1e-30;
        minTwist        0.001;
        minDeterminant  1e-06;
        minFaceWeight   1e-06;
        minVolRatio     0.01;
        minTriangleTwist -1;
        minFlatness     0.5;
        maxNonOrtho     75;
        maxBoundarySkewness 20;
        maxInternalSkewness 8;
        maxConcave      80;
        nSmoothScale    4;
        errorReduction  0.75;
    }
}

mergeTolerance  1e-06;

debug           0;

writeFlags
(
    scalarLevels    
    layerSets       
    layerFields     
);



// ************************************************************************* //
