background/system/topoSetDictZ0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c01;
        type    cellSet;
        action  new;
        source      fieldToCell;
        field       cellLevel;
        min         1;
        max         4;
    }

    {
        name    c02;
        type    cellSet;
        action  new;
        source      fieldToCell;
        field       cellLevel;
        min         2;
        max         4;    
    }
    
    {
        name    c03;
        type    cellSet;
        action  new;
        source      fieldToCell;
        field       cellLevel;
        min         3;
        max         4;    
    }

    {
        name    c04;
        type    cellSet;
        action  new;
        source      fieldToCell;
        field       cellLevel;
        min         4;
        max         4;   
    }
);

// ************************************************************************* //
